In [1]:
import pandas as pd

In [2]:
a={'이름':['홍길동', '사람1','사람2'], '나이':[20,30,25]}

In [3]:
df1 =pd.DataFrame(a)
df1

    이름  나이
0  홍길동  20
1  사람1  30
2  사람2  25

In [4]:
b={'이름':['홍길동', '사람1','사람2'], '도시':['서울', '서울','대전']}

In [5]:
df2=pd.DataFrame(b)
df2

    이름  도시
0  홍길동  서울
1  사람1  서울
2  사람2  대전

In [6]:
df=pd.merge(left=df1,right=df2, how = 'left', left_on = '이름', right_on='이름')
df

    이름  나이  도시
0  홍길동  20  서울
1  사람1  30  서울
2  사람2  25  대전

In [8]:
x1 = (df['도시'] == '서울')
df[x1]

    이름  나이  도시
0  홍길동  20  서울
1  사람1  30  서울

In [9]:
x2 = (df['도시'] != '서울')
df[x2]

    이름  나이  도시
2  사람2  25  대전

In [10]:
x3 = df['나이'] < 30
df[x3]

    이름  나이  도시
0  홍길동  20  서울
2  사람2  25  대전

In [12]:
x4 = (df['도시']=='서울') & (df['나이'] < 30)
df[x4]

    이름  나이  도시
0  홍길동  20  서울

In [13]:
x5 = (df['도시']=='서울') | (df['나이'] < 30)
df[x5]

    이름  나이  도시
0  홍길동  20  서울
1  사람1  30  서울
2  사람2  25  대전